using System.Threading.Tasks;
using WebApp.Data.Seed;
using WebApp.Models;

namespace WebApp.Data.SeedData;

public class QuestionsSeeder : ISeeder
{
    public void Seed(AppDbContext db)
    {
        var tasks = db.TestTasks
            .OrderBy(t => t.Number)
            .ToDictionary(t => t.Number, t => t);

        if (!tasks.Any()) throw new Exception("Сначала нужно засидировать задания");

        if (db.TaskQuestions.Any())
        {
            Console.WriteLine("Вопросы уже существуют — пропускаем сидирование вопросов.");
            return;
        }

        if (tasks.TryGetValue(1, out var task1))
        {
            db.TaskQuestions.AddRange(
                new TrueFalseQuestion
                {
                    TaskId = task1.Id,
                    Order = 1,
                    TextRu = "Валовые инвестиции растут, если темпы прироста продаж товаров падают.",
                    TextKk = "Жалпы инвестициялар тауарлар сатылымының өсу қарқыны төмендегенде өседі.",
                    Points = 1,
                    CorrectAnswer = false
                },
                new TrueFalseQuestion
                {
                    TaskId = task1.Id,
                    Order = 2,
                    TextRu = "Фаза подъема экономического цикла всегда совпадает с периодом оживления.",
                    TextKk = "Экономикалық циклдің өрлеу фазасы әрқашан жандану кезеңімен сәйкес келеді.",
                    Points = 1,
                    CorrectAnswer = false
                },
                new TrueFalseQuestion
                {
                    TaskId = task1.Id,
                    Order = 3,
                    TextRu = "Объем инвестиций в машины и оборудование обычно не увеличивается перед наступающим кризисом и после его завершения.",
                    TextKk = "Машиналар мен жабдықтарға инвестициялар көлемі әдетте дағдарыс алдында және оның аяқталғаннан кейін ұлғаймайды.",
                    Points = 1,
                    CorrectAnswer = true
                }
            );
            db.SaveChanges();
        }
        if (tasks.TryGetValue(2, out var task2))
        {
            db.TaskQuestions.Add(
                new MultipleChoiceQuestion
                {
                    TaskId = task2.Id,
                    Order = 1,
                    TextRu = "Экономические отношения выражают связи:",
                    TextKk = "Экономикалық қатынастар байланыстарды білдіреді:",
                    Points = 1,
                    OptionsRu = new List<string> {
                    "между вещами типа «вещь — вещь» (например, обмен товаров на деньги)",
                    "между людьми типа «человек — человек» (например, продавец — покупатель)",
                    "между людьми, связанными с вещами, типа «человек — вещь — человек» (например, продавец — товар — деньги — покупатель)"
                    },
                    OptionsKk = new List<string> {
                    "заттар арасындағы байланыстар («зат — зат», мысалы тауарды ақшаға айырбастау)",
                    "адамдар арасындағы байланыстар («адам — адам», мысалы сатушы — сатып алушы)",
                    "заттармен байланысты адамдар арасындағы байланыстар («адам — зат — адам», мысалы сатушы — тауар — ақша — сатып алушы)"
                    },
                    CorrectOptionIndex = 2
                }
            );
            db.SaveChanges();
        }
        if (tasks.TryGetValue(3, out var task3))
        {
            db.TaskQuestions.Add(
                new CategorizationQuestion
                {
                    TaskId = task3.Id,
                    Order = 1,
                    Points = 7,
                    TextRu = "Укажите, какие из утверждений характеризуют признаки натурального хозяйства, а какие — товарного производства",
                    TextKk = "Тұжырымдамалардың қайсысы күнкөріс шаруашылығының, ал қайсысы тауар өндірісінің сипаттамаларын сипаттайтынын көрсетіңіз.",
                    Category1Ru = "Натуральное хозяйство",
                    Category2Ru = "Товарное производство",
                    Category1Kk = "Табиғи шаруашылық",
                    Category2Kk = "Тауарлық өндіріс",
                    TermsRu = new List<string> {
                        "В замкнутой экономической единице ведется производство готового продукта и его потребление",
                        "Трудовой процесс базируется на традиционных обычаях и принудительных хозяйственных связях",
                        "Производство основано как на индивидуальном труде собственника, так и на применении наемной рабочей силы",
                        "Производство ведется с применением малопроизводительных орудий труда",
                        "Изготовленная продукция предназначена для свободной реализации на рынке",
                        "Экономическая эволюция происходит очень медленно",
                        "Быстрый экономический прогресс общества связан с ростом производительности труда"
                    },
                    TermsKk = new List<string> {
                        "Жабық экономикалық бірлікте дайын өнімді өндіру және оны тұтыну жүзеге асырылады",
                        "Еңбек процесі дәстүрлі әдет-ғұрыптар мен мәжбүрлі шаруашылық байланыстарға негізделген",
                        "Өндіріс иесінің жеке еңбегіне және жалдамалы жұмыс күшін пайдалануға негізделген",
                        "Өндіріс өнімділігі төмен құралдарды қолдану арқылы жүзеге асырылады",
                        "Өндірілген өнім нарықта еркін өткізуге арналған",
                        "Экономикалық эволюция өте баяу жүреді",
                        "Қоғамның жылдам экономикалық прогрессі еңбек өнімділігінің өсуімен байланысты"
                    },
                    CorrectMapping = new Dictionary<int, int> { { 0, 1 }, { 1, 1 }, { 2, 2 }, { 3, 1 }, { 4, 2 }, { 5, 1 }, { 6, 2 } }
                }
            );
            db.SaveChanges();
        }
        if (tasks.TryGetValue(4, out var task4))
        {
            db.TaskQuestions.Add(
                new MatchingQuestion
                {
                    TaskId = task4.Id,
                    Order = 1,
                    Points = 8,
                    TextRu = "Для каждого из приведенных здесь понятий и терминов подберите соответствующее ему определение.",
                    TextKk = "Мұнда келтірілген ұғымдар мен терминдердің әрқайсысы үшін оған сәйкес анықтаманы таңдаңыз.",
                    LeftItemsRu = new List<string>
                        {
                            "Чистая монополия",
                            "Монопсония",
                            "Легальная монополия",
                            "Патент",
                            "Естественная монополия",
                            "Неценовая конкуренция",
                            "Олигополия",
                            "Монополистическая конкуренция"
                        },
                    RightItemsRu = new List<string>
                        {
                            "На рынке действует один продавец",
                            "На рынке действует один покупатель",
                            "Монополия по закону использует патенты, торговые знаки, авторские права",
                            "Свидетельство о праве на созданное изобретение",
                            "Монополия имеет редкие ресурсы или важные для общества виды хозяйства",
                            "Соперничество в области качества, технического превосходства товаров",
                            "Рынок, на котором несколько крупных продавцов",
                            "Соперничество монополистов отдельных разновидностей продукта"
                        },
                    LeftItemsKk = new List<string>
                        {
                            "Таза монополия",
                            "Монопсония",
                            "Заңды монополия",
                            "Патент",
                            "Табиғи монополия",
                            "Бағалық емес бәсекелестік",
                            "Олигополия",
                            "Монополиялық бәсекелестік"
                        },
                    RightItemsKk = new List<string>
                        {
                            "Нарықта бір сатушы бар",
                            "Нарықта бір сатып алушы бар",
                            "Монополия заң бойынша патенттерді, сауда белгілерін, авторлық құқықты пайдаланады",
                            "Жасалған өнертабысқа құқық туралы куәлік",
                            "Монополияда сирек ресурстар немесе қоғам үшін маңызды шаруашылық түрлері бар",
                            "Тауарлардың сапасы, техникалық артықшылығы саласындағы бәсекелестік",
                            "Бірнеше ірі сатушылар бар нарық",
                            "Өнімнің жекелеген сорттарының монополистерінің бәсекелестігі"
                        },
                    CorrectMatches = new Dictionary<int, int>
                        {
                            {0,0},{1,1},{2,2},{3,3},{4,4},{5,5},{6,6},{7,7}
                        }
                }
            );
            db.SaveChanges();
        }
        if (tasks.TryGetValue(5, out var task5))
        {
            db.TaskQuestions.Add(
                new TableQuestion
                {
                    TaskId = task5.Id,
                    Order = 1,
                    Points = 4,
                    TextRu = "В таблице   представлена информация  об издержках и уровне продаж фирмы. Рассчитайте предельные издержки фирмы, общий и предельный доход.  Определите, при каких значениях цены и объема продаж фирма получит максимальную прибыль.",
                    TextKk = "Кестеде компанияның шығындары мен сату деңгейі туралы ақпарат берілген. Фирманың шекті шығындарын, жалпы және шекті кірісті есептеңіз. Фирма максималды пайда алатын баға мен сатылым көлемінің мәндерін анықтаңыз.",
                    HeadersRu = new List<string>
                        {
                            "Объем продаж (Q), ед.",
                            "Цена за единицу изделия (P), у.е.",
                            "Общие издержки (TC), у.е.",
                            "Предельные издержки (MC), у.е.",
                            "Общий доход (TR), у.е.",
                            "Предельный доход (MR), у.е.",
                            "Условие равновесия фирмы (МС и МR)"
                        },
                    HeadersKk = new List<string>
                        {
                            "Сату көлемі (Q),бір.",
                            "Өнім бірлігінің бағасы (Р), у.е.",
                            "Жалпы шығындар (TC), у.е.",
                            "Шекті шығындар (MC), у.е.",
                            "Жалпы табыс (TR), у.е.",
                            "Шекті кіріс (МR), у.е.",
                            "Компанияның тепе-теңдік шарты (MСжәне MR қатынасы)"
                        },
                        TableDataRu = new List<List<string>>
                        {
                            new() { "0",   "200", "150", "", "", "", "" },
                            new() { "1",   "175", "260", "", "", "", "" },
                            new() { "2",   "150", "320", "", "", "", "" },
                            new() { "3",   "135", "366", "", "", "", "" },
                            new() { "4",   "120", "400", "", "", "", "" },
                            new() { "5",   "105", "445", "", "", "", "" },
                            new() { "6",   "90",  "510", "", "", "", "" }
                        },
                        TableDataKk = new List<List<string>>
                        {
                            new() { "0",   "200", "150", "", "", "", "" },
                            new() { "1",   "175", "260", "", "", "", "" },
                            new() { "2",   "150", "320", "", "", "", "" },
                            new() { "3",   "135", "366", "", "", "", "" },
                            new() { "4",   "120", "400", "", "", "", "" },
                            new() { "5",   "105", "445", "", "", "", "" },
                            new() { "6",   "90",  "510", "", "", "", "" }
                        },
                        EditableColumns = new List<int> { 3, 4, 5, 6 },
                        CorrectAnswers = new List<List<string>>
                        {
                            new() { "110", "175", "175", "МС<МR" },   
                            new() { "60",  "300", "125", "МС<МR" },  
                            new() { "46",  "405", "105", "МС<МR" },
                            new() { "34",  "480", "75",  "МС<МR" },   
                            new() { "45",  "525", "45",  "МС=МR" },  
                            new() { "65",  "540", "15",  "МС>МR" }    
                        },
                        CorrectOptimalQ = "5",
                        CorrectOptimalP = "105"
                });
            db.SaveChanges();
        }

        Console.WriteLine("Все вопросы добавлены");
    }
}